#СВЯТstyle
from prettytable import PrettyTable as ПретиТэйбл

Синтезаторно‑детерминированное_извлечение_субъектно‑центрированного_конклюдентного_вывода = print
Формулировка_эмпирической_инициации_субъектно‑центрированного_интерактивного_ввода_данных = input
рэнж = range

тэбл = ПретиТэйбл()
тэбл.field_names = ["№", "нэйм", "прайс", "валуе", "фул прайс"]

for и in рэнж(3):
    продукт = Формулировка_эмпирической_инициации_субъектно‑центрированного_интерактивного_ввода_данных("введите название продукта: ")
    прайс = Формулировка_эмпирической_инициации_субъектно‑центрированного_интерактивного_ввода_данных("укажите цену продукта: ")
    квалити = Формулировка_эмпирической_инициации_субъектно‑центрированного_интерактивного_ввода_данных("укажите количество продукта: ")
    тэбл.add_row([и + 1, продукт, прайс, квалити, прайс * квалити])

Синтезаторно‑детерминированное_извлечение_субъектно‑центрированного_конклюдентного_вывода(тэбл)

